custom_models/sphere_con/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       20970;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          140;
        startFace       21010;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10600;
        startFace       21150;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10600;
        startFace       31750;
    }
    sphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       42350;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       42450;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       42490;
    }
)

// ************************************************************************* //
