custom_models/sphere_con/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform (1e-3 0 0 );
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
    	type		noSlip;
    	//type		fixedValue;
    	//value		uniform (0 0 0);
    }
    sphere
    {
    	type		noSlip;
    	//type		fixedValue;
    	//value		uniform (0 0 0);
    }
    
    front
    {
        type           wedge;
    }
    back
    {
    	type		wedge;
    }
    axis
    {
    	type		empty;
    }    
}

// ************************************************************************* //
